print('Собака короткошерстной породы?')
a = input()
if a == 'да':
    print('Рост собаки менее 50 см?')
    a1 = input()
    if a1 == 'да':
        print('У собаки короткий хвост?')
        a2 = input()
        if a2 == 'да':
            print('английский бульдог')
        elif a2 == 'нет':
            print('У собаки длинные уши?')
            a3 = input()
            if a3 == 'да':
                print('гончая')
            elif a3 == 'нет':
                print('У собаки короткое тело')
                a4 = input()
                if a4 == 'да':
                    print('мопс')
                elif a4 == 'нет':
                    print('чихуаха')
    elif a1 == 'нет':
        print('Собака весит более 50 кг?')
        a5 = input()
        if a5 == 'да':
            print('датский дог')
        elif a5 == 'нет':
            print('фоксхаунд')
elif a == 'нет':
    print('Рост собаки менее 50 см?')
    a6 = input()
    if a6 == 'да':
        print('У собаки доброжелательный характер?')
        a7 = input()
        if a7 == 'да':
            print('кокер-спаниэль')
        elif a7 == 'нет':
            print('ирландский сеттер')
    elif a6 == 'нет':
        print('У собаки рост менее 70 см?')
        a8 = input()
        if a8 == 'да':
            print('У собаки длинные уши?')
            a9 = input()
            if a9 == 'да':
                print('большой вандейский грифон')
            elif a9 == 'нет':
                print('колли')
        elif a8 == 'нет':
            print('Окрас рыжий с белыми отметинами?')
            a10 = input()
            if a10 == 'да':
                print('сенбернар')
            elif a10 == 'нет':
                print('Белоснежный окрас?')
                a11 = input()
                if a11 == 'да':
                    print('рландский волкодав')
                elif a11 == 'нет':
                    print('ньюфаунленд')
                    
                

        
